// Завдання: Групування книг за десятиліттями та підрахунок кількості книг у кожному десятилітті
// Створіть функцію groupBooksByDecade(books), яка групує книги за десятиліттями їхнього видання
// і підраховує кількість книг, що потрапляють в кожне десятиліття.

// Умова:
// Книга належить до десятиліття, якщо її рік видання потрапляє в певне десятиліття. Наприклад, якщо книга видана в 1951 році,
// вона належить до 1950-х років.
// Функція повинна використовувати reduce() для створення об'єкта, де ключами є десятиліття,
// а значеннями — кількість книг, які були видані в цьому десятилітті.
// Якщо книга була видана в 2025 році, вона має належати до 2020-х років.

// Створіть функцію groupBooksByDecade, яка групує книги по десятиліттях. Рік книги потрібно округляти
// до найближчого десятиліття, тобто для книги 1951 року це буде 1950-ті, для 1997 року — 1990-ті тощо.

const groupBooksByDecade = (books) => {
    return books.reduce((accumulator, book) => {
        const decade = Math.floor(book.year / 10) * 10;

        if (accumulator[decade]) {
            accumulator[decade] += book;
        } else {
            accumulator[decade] = book;
        }
        return accumulator;
    }, {});
};
 
console.log(groupBooksByDecade(books));